gWacey/sdk-nrf/applications/nrf5340_audio/src/audio_module/amod_api.c
/*
 * Copyright(c) 2018 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include "amod_api.h"

#include <stdlib.h>
#include <stdio.h>
#include <ctype.h>
#include <zephyr/kernel.h>
#include <zephyr/shell/shell.h>
#include <nrfx_clock.h>
#include "data_fifo.h"
#include "amod_api_private.h"

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(amod_api, 3);

/**
 * @brief Macro to test if the module is in the running state or the state is unknown.
 *
 */
#define TEST_STATE_RUNNING(state)                                                                  \
	(((state) == AMOD_STATE_RUNNING || (state) >= AMOD_STATE_UNKNOWN) ? true : false)

/**
 * @brief Macro to test if the module is in the open state or the state is unknown.
 *
 */
#define TEST_STATE_OPEN(state)                                                                     \
	(((state) == AMOD_STATE_OPEN || (state) >= AMOD_STATE_UNKNOWN) ? true : false)

/**
 * @brief Macro to test if the module is in the running state or open state or the state is unknown.
 *
 */
#define TEST_STATE_RUNNING_OR_OPEN(state)                                                          \
	(((state) == AMOD_STATE_RUNNING || (state) == AMOD_STATE_OPEN ||                           \
	  (state) >= AMOD_STATE_UNKNOWN) ?                                                         \
		 true :                                                                            \
		 false)

/**
 * @brief Helper function to validate the module description.
 *
 * @param parameters  The module parameters
 *
 * @return 0 if successful, error value
 */
static int validate_description(struct amod_parameters *parameters)
{
	if (parameters == NULL) {
		LOG_DBG("No description for module");
		return -EINVAL;
	}

	if ((parameters->description->type != AMOD_TYPE_INPUT &&
	     parameters->description->type != AMOD_TYPE_OUTPUT &&
	     parameters->description->type != AMOD_TYPE_PROCESSOR) ||
	    parameters->description->name == NULL || parameters->description->functions == NULL) {
		LOG_DBG("Error in description for module");
		return -EINVAL;
	}

	return 0;
}

/**
 * @brief General function for releasing the audio object when intermodule object
 *        passing.
 *
 * @param handle  The handle of the sending modules instance
 * @param object  Pointer to the audio data object to send to the module
 */
void object_release_cb(struct amod_handle *handle, struct aobj_object *object)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;

	k_sem_take(&hdl->sem, K_NO_WAIT);

	if (k_sem_count_get(&hdl->sem) == 0) {
		/* Object data has been consumed by all modules so now can free the memory */
		data_fifo_block_free(&hdl->out_msg, (void **)&object->data);
	}
}

/**
 * @brief Send a data buffer to a module, all data is consumed by the module.
 *
 * @param tx_handle    The handle for the sending module instance
 * @param rx_handle    The handle for the receiving module instance
 * @param object       Pointer to the audio data object to send to the module
 * @param response_cb  A pointer to a callback to run when the buffer is
 *                     fully comsumed
 *
 * @return 0 if successful, error value
 */
static int data_send(struct _amod_handle *tx_handle, struct _amod_handle *rx_handle,
		     struct aobj_object *object, amod_response_cb data_in_response_cb)
{
	struct _amod_in_message *data_in_msg;
	int ret;

	ret = data_fifo_pointer_first_vacant_get(&rx_handle->in_msg, (void **)&data_in_msg,
						 K_NO_WAIT);
	if (ret) {
		LOG_DBG("Module %s no free data buffer, ret %d", rx_handle->name, ret);
		return ret;
	}

	/* fill data */
	data_in_msg->object = object;
	data_in_msg->tx_handle = (struct amod_handle *)tx_handle;
	data_in_msg->response_cb = data_in_response_cb;

	ret = data_fifo_block_lock(&rx_handle->in_msg, (void **)&data_in_msg,
				   sizeof(struct _amod_in_message));
	if (ret) {
		data_fifo_block_free(&rx_handle->in_msg, (void **)&data_in_msg);

		LOG_DBG("Module %s failed to return output buffer, ret %d", rx_handle->name, ret);
		return ret;
	}

	LOG_DBG("Data sent to module %s", rx_handle->name);

	return 0;
}

/**
 * @brief Function to clean up items if a procedure fails.
 *
 */
static void clean_up(struct _amod_handle *hdl, struct _amod_in_message **in_msg,
		     struct _amod_out_message **out_msg, char **data)
{
	if ((*in_msg)->response_cb != NULL) {
		(*in_msg)->response_cb((*in_msg)->tx_handle, (*in_msg)->object);
	}

	if ((*in_msg) != NULL) {
		data_fifo_block_free(&hdl->in_msg, (void **)(*in_msg));
	}

	if ((*out_msg) != NULL) {
		data_fifo_block_free(&hdl->out_msg, (void **)(*out_msg));
	}

	if ((*data) != NULL) {
		k_mem_slab_free(&hdl->data_slab, (void **)(*data));
	}
}

/**
 * @brief The thread that receives data from outside the system and passes it into the audio system.
 *
 * @param handle  The handle for this modules instance
 *
 * @return 0 if successful, error value
 */
static int module_thread_input(struct amod_handle *handle)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;
	struct _amod_handle *hdl_to;
	struct _amod_in_message *in_msg = NULL;
	struct _amod_out_message *out_msg;
	int ret;
	char *data;

	if (handle == NULL) {
		LOG_DBG("Error in the module task as handle NULL");
		return -EINVAL;
	}

	/* Execute thread */
	for (;;) {
		out_msg = NULL;
		data = NULL;

		if (hdl->functions->data_process != NULL) {
			/* Get a new output buffer */
			ret = k_mem_slab_alloc(&hdl->data_slab, (void **)&data, K_FOREVER);
			if (ret) {
				clean_up(hdl, &in_msg, &out_msg, &data);

				LOG_DBG("No free data buffer for module %st, ret %d", hdl->name,
					ret);
				continue;
			}

			ret = data_fifo_pointer_first_vacant_get(&hdl->out_msg, (void **)&out_msg,
								 K_FOREVER);
			if (ret) {
				clean_up(hdl, &in_msg, &out_msg, &data);

				LOG_DBG("No free message for module %s, ret %d", hdl->name, ret);
				continue;
			}

			/* Configure new audio object */
			out_msg->object.data = data;
			out_msg->object.data_size = hdl->data_size;

			/* Process the input audio object */
			ret = hdl->functions->data_process(handle, NULL, &out_msg->object);
			if (ret) {
				clean_up(hdl, &in_msg, &out_msg, &data);

				LOG_DBG("Data process error in module %s, ret %d", hdl->name, ret);
				continue;
			}

			/* Send input audio object to next module(s) */
			if (!sys_slist_is_empty(&hdl->hdl_dest_list)) {
				k_mutex_lock(&hdl->dest_mutex, K_FOREVER);
				k_sem_init(&hdl->sem, 0, hdl->dest_count);

				SYS_SLIST_FOR_EACH_CONTAINER(&hdl->hdl_dest_list, hdl_to, node) {
					ret = data_send(hdl, hdl_to, &out_msg->object,
							&object_release_cb);
					if (ret) {
						LOG_DBG("Failed to send to module %s from %s",
							hdl_to->name, hdl->name);
					} else {
						k_sem_give(&hdl->sem);
					}
				}

				k_mutex_unlock(&hdl->dest_mutex);
			} else {
				/* Send input audio object */
				ret = data_fifo_block_lock(&hdl->out_msg, (void **)&out_msg,
							   sizeof(struct _amod_in_message));
				if (ret) {
					clean_up(hdl, &in_msg, &out_msg, &data);

					LOG_DBG("Module %s failed to return output buffer, ret %d",
						hdl->name, ret);
					continue;
				}
				LOG_DBG("Data sent from module %s", hdl->name);
			}

		} else {
			LOG_DBG("No process function for module %s, discarding input", hdl->name);
		}
	}

