gWacey/sdk-nrf/applications/nrf5340_audio/src/audio_module/amod_api.c
	if (hdl->type == AMOD_TYPE_INPUT && out_msg_block == NULL && data_block == NULL) {
		LOG_DBG("Incorrect memory for module %s in the open function", name);
		return -EINVAL;
	}

	if (hdl->type == AMOD_TYPE_OUTPUT && in_msg_block == NULL) {
		LOG_DBG("Incorrect memory for module %s in the open function", name);
		return -EINVAL;
	}

	if (in_msg_block == NULL && out_msg_block == NULL && data_block == NULL) {
		LOG_DBG("Incorrect memory for module %s in the open function", name);
		return -EINVAL;
	}

	hdl->previous_state = AMOD_STATE_UNKNOWN;
	hdl->state = AMOD_STATE_UNKNOWN;

	hdl->context = (struct amod_context *)((char *)handle + WB_UP(sizeof(struct _amod_handle)));

	memcpy(hdl->name, name, AMOD_NAME_SIZE);
	memcpy(hdl->base_name, parameters->description->name, AMOD_NAME_SIZE);
	hdl->functions = (struct _amod_functions *)parameters->description->functions;

	memcpy(&hdl->thread, &parameters->thread, sizeof(struct amod_thread_configuration));

	sys_slist_init(&hdl->hdl_dest_list);
	k_mutex_init(&hdl->dest_mutex);

	if (hdl->functions->open != NULL) {
		ret = hdl->functions->open((struct amod_handle *)hdl, configuration);
		if (ret) {
			LOG_DBG("Failed open call to module %s, ret %d", name, ret);
			return ret;
		}
	}

	if (hdl->type != AMOD_TYPE_INPUT) {
		hdl->in_msg.msgq_buffer = in_msg_block;
		hdl->in_msg.slab_buffer =
			in_msg_block + AMOD_IN_MSG_SET_SIZE(hdl->thread.in_msg_num);
		hdl->in_msg.block_size_max = sizeof(struct _amod_in_message);
		hdl->in_msg.elements_max = hdl->thread.in_msg_num;
		hdl->in_msg.initialized = false;
		ret = data_fifo_init(&hdl->in_msg);
		if (ret) {
			LOG_DBG("Failed to initialise module %s data in FIFO, ret %d", hdl->name,
				ret);
			return ret;
		}
	}

	if (hdl->type != AMOD_TYPE_OUTPUT) {
		hdl->out_msg.msgq_buffer = out_msg_block;
		hdl->out_msg.slab_buffer =
			out_msg_block + AMOD_OUT_MSG_SET_SIZE(hdl->thread.out_msg_num);
		hdl->out_msg.block_size_max = sizeof(struct _amod_out_message);
		hdl->out_msg.elements_max = hdl->thread.out_msg_num;
		hdl->out_msg.initialized = false;
		ret = data_fifo_init(&hdl->out_msg);
		if (ret) {
			LOG_DBG("Failed to initialise module %s data output FIFO, ret %d",
				hdl->name, ret);
			return ret;
		}

		hdl->data_size = WB_UP(hdl->data_size);
		ret = k_mem_slab_init(&hdl->data_slab, data_block, hdl->data_size, data_num);
		if (ret) {
			LOG_DBG("Failed to initialise module %s data slab, ret %d", hdl->name, ret);
			return ret;
		}

		/*		ret = sys_sem_init(&hdl->sem_count, 0, CONFIG_AMOD_SINK_MODULE_NUM);
		if (ret) {
			LOG_DBG("Failed to intiialise module %s counting semaphore, ret %d",
				hdl->name, ret);
			return ret;
		}
		*/
	}

	switch (hdl->type) {
	case AMOD_TYPE_INPUT:
		hdl->thread_id =
			k_thread_create(&hdl->thread_data, hdl->thread.stack,
					hdl->thread.stack_size,
					(k_thread_entry_t)module_thread_input, hdl, NULL, NULL,
					K_PRIO_PREEMPT(hdl->thread.priority), 0, K_NO_WAIT);

		ret = k_thread_name_set(hdl->thread_id, hdl->name);
		if (ret) {
			LOG_DBG("Failed to start input module %s thread, ret %d", hdl->name, ret);
			return ret;
		}

		break;

	case AMOD_TYPE_OUTPUT:
		hdl->thread_id =
			k_thread_create(&hdl->thread_data, hdl->thread.stack,
					hdl->thread.stack_size,
					(k_thread_entry_t)module_thread_output, hdl, NULL, NULL,
					K_PRIO_PREEMPT(hdl->thread.priority), 0, K_NO_WAIT);

		ret = k_thread_name_set(hdl->thread_id, hdl->name);
		if (ret) {
			LOG_DBG("Failed to start output module %s thread, ret %d", hdl->name, ret);
			return ret;
		}

		break;

	case AMOD_TYPE_PROCESSOR:
		hdl->thread_id =
			k_thread_create(&hdl->thread_data, hdl->thread.stack,
					hdl->thread.stack_size,
					(k_thread_entry_t)module_thread_processor, hdl, NULL, NULL,
					K_PRIO_PREEMPT(hdl->thread.priority), 0, K_NO_WAIT);

		ret = k_thread_name_set(hdl->thread_id, hdl->name);
		if (ret) {
			LOG_DBG("Failed to start processor module %s thread, ret %d", hdl->name,
				ret);
			return ret;
		}

		break;

	default:
		LOG_DBG("Invalid module type %d for module %s", hdl->type, hdl->name);
		return -EINVAL;
	}

	hdl->state = AMOD_STATE_OPEN;

	LOG_DBG("Module %s is now open", hdl->name);

	return 0;
}

/**
 * @brief  Function to close an open module.
 */
int amod_close(struct amod_handle *handle)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;
	int ret;

	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (TEST_STATE_RUNNING(hdl->state)) {
		LOG_DBG("Module %s in an invalid state, %d, for close", hdl->name, hdl->state);
		return -ENOTSUP;
	}

	if (hdl->functions->close != NULL) {
		ret = hdl->functions->close(handle);
		if (ret) {
			LOG_DBG("Failed close call to module %s, returned %d", hdl->name, ret);
			return ret;
		}
	} else {
		LOG_DBG("Module %s has no close function", hdl->name);
	}

	data_fifo_empty(&hdl->in_msg);
	data_fifo_empty(&hdl->out_msg);

	k_thread_abort(hdl->thread_id);

	return 0;
};

/**
 * @brief  Function to set the configuration of a module.
 */
int amod_configuration_set(struct amod_handle *handle, struct amod_configuration *configuration)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;
	int ret;

	if (handle == NULL || configuration == NULL) {
		LOG_DBG("Module input parameter error");
		return -EINVAL;
	}

	if (TEST_STATE_OPEN(hdl->state)) {
		LOG_DBG("Module %s in an invalid state, %d, for setting the configuration",
			hdl->name, hdl->state);
		return -ENOTSUP;
	}

	if (hdl->functions->configuration_set != NULL) {
		ret = hdl->functions->configuration_set(handle, configuration);
		if (ret) {
			LOG_DBG("Set configuration for module %s send failed, ret %d", hdl->name,
				ret);
			return ret;
		}
	} else {
		LOG_DBG("No set configuration function for module %s", hdl->name);
	}

	hdl->previous_state = hdl->state;
	hdl->state = AMOD_STATE_CONFIGURED;

	return 0;
};

/**
 * @brief  Function to get the configuration of a module.
 */
int amod_configuration_get(struct amod_handle *handle, struct amod_configuration *configuration)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;
	int ret;

	if (handle == NULL || configuration == NULL) {
		LOG_DBG("Module input parameter error");
		return -EINVAL;
	}

	if (TEST_STATE_OPEN(hdl->state)) {
		LOG_DBG("Module %s in an invalid state, %d, for getting the configuration",
			hdl->name, hdl->state);
		return -ENOTSUP;
	}

	if (hdl->functions->configuration_get != NULL) {
		ret = hdl->functions->configuration_get(handle, configuration);
		if (ret) {
			LOG_DBG("Get configuration for module %s failed, ret %d", hdl->name, ret);
			return ret;
		}
	} else {
		LOG_DBG("No get configuration function for module %s", hdl->name);
		return -ENOSYS;
	}

